{"data":{"type":"pages","id":"concept/debugging","attributes":{"html":"<h2 id=\"debugginginvestigatingissues\">Debugging, investigating issues</h2>\n<p><code>ember-cli-yadda-opinionated</code> provides handy ways to investigate problems and avoid frustration.</p>\n<h2 id=\"richerrormessages\">Rich error messages</h2>\n<p>One big problem with Cucumber is how difficult it is to debug a problem.</p>\n<p>Typically, you'd receive a non-meaningful error such as \"Expected 1 to be 0\". To make errors meaningful, a lot of effort needs to be put into carefully crafting <em>each</em> step.</p>\n<p><code>ember-cli-yadda-opinionated</code> <em>automatically</em> provides helpful detailed information, whenever a test crashes with an assertion error or exception:</p>\n<p><img src={{root-url \"error.png\"}} alt=\"Screenshot\"></p>\n<p>Here's what you get out of the box:</p>\n<ul>\n<li><p>The name of the step that failed.</p></li>\n<li><p>The name of the implementation that was selected for that step.</p>\n<p>With Cucumber, a lot of grief often comes from a wrong implementation being selected for a step. Such a situation would typically produce an irrelevant error message.</p>\n<p><code>ember-cli-yadda-opinionated</code> lets you effortlessly montior which implementation has been selected for which step, including passed steps.</p></li>\n<li><p>The error message.</p></li>\n<li><p>The list of arguments passed into the step implementation.</p>\n<p>This lets you see whether Yadda macros have been expanded properly.</p>\n<p>Each label argument will be expanded to show the label itself, resulting selector and the amount of elements matched on the page.</p></li>\n</ul>\n<p>This drastically simplifies investigating errors.</p>\n<h2 id=\"pausinganddebugging\">Pausing and debugging</h2>\n<p>Additionally, the addon provides you with two simple steps: <code>And pause</code> and <code>And debugger</code>.</p>\n<p>Both will stop the test and lets you inspect the app in its current state.</p>\n<p><code>And pause</code> is perfect for development ahead of the backend. Setting up Mirage and seedin any particular state you need lets you develop the frontend without waiting for the backend to implement the API.</p>\n<p><code>And debugger</code> lets you see what exact state the next step starts with. It is a very common problem that a certain process in the app is not waited upon, and the next step fires too early. The resulting error message will typically be unhelpful and cause frustration. Whenever you feel frustrated, put <code>And debugger</code> before the failing step and check of the app is in the correct state!</p>","title":"Debugging","index":5}}}